# Customer Shared - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/customer/shared/infrastructure/workspaces/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/connectilly/staging-customer/runs/run-9EbkiViQMuf88Fkf

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.database.cockroach_cluster.default: Refreshing state... [id=a9d76d5e-fdb9-4bb9-941d-800d6d400e8d]
module.database.cockroach_database.default: Refreshing state... [id=a9d76d5e-fdb9-4bb9-941d-800d6d400e8d:customer]
module.database.aws_ssm_parameter.default: Refreshing state... [id=staging-customer-database-cluster-id]
module.database_migration_user.data.aws_ssm_parameter.cluster_id: Refreshing...
module.database_migration_user.random_password.password: Refreshing state... [id=none]
module.database_migration_user.data.aws_ssm_parameter.cluster_id: Refresh complete after 0s [id=staging-customer-database-cluster-id]
module.database_migration_user.cockroach_sql_user.default: Refreshing state... [id=a9d76d5e-fdb9-4bb9-941d-800d6d400e8d:database-migration]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "customer"
      + id                = "a9d76d5e-fdb9-4bb9-941d-800d6d400e8d"
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "database-migration"
    }

  # module.database_migration_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "a9d76d5e-fdb9-4bb9-941d-800d6d400e8d:database-migration"
        name       = "database-migration"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.database_migration_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "ada618a8-8eb8-48dc-a4ce-6af12994b230" -> "43c2e367-5859-434e-bf88-5dc7c282c1ac"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ database_migration_user_connection_string = (sensitive value)

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*